app/views/lesson_plans/_form.html.erb


  <div class="form-group d-flex flex-wrap<%= ' field_with_errors' if @lesson_plan.errors[:subject].any? %>">
    <%= f.label "Subject: " %> <br>
    <%= collection_select(:lesson_plan, :subject_id, Subject.all, :id, :sub_name, prompt: true, class: "select") %> <br>
    </div>
  <div class="form-group d-flex flex-wrap<%= ' field_with_errors' if @lesson_plan.errors[:subject].any? %>">
---
SELECT "subjects".* FROM "subjects"
SELECT 1 AS one FROM "subjects" LIMIT ?  [["LIMIT", 1]]

    <%= f.label :books, "Book(s): " %> <br>
    <%= f.collection_check_boxes :book_ids, Book.all, :id, :title, class: 'checkbox' %>
---
SELECT "books".* FROM "books"