app/views/lesson_plans/index.html.erb


  <% if current_user.lesson_plans.empty? %>
---
SELECT "lesson_plans".* FROM "lesson_plans" WHERE "lesson_plans"."user_id" = ?  [["user_id", 2]]
SELECT 1 AS one FROM "lesson_plans" WHERE "lesson_plans"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]