app/views/lesson_plans/show.html.erb

  <p>Book(s):
    <% @lesson_plan.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."lesson_plan_id" = $1  [["lesson_plan_id", 1]]