app/views/books/_form.html.erb

SELECT "subjects".* FROM "subjects"
---
    <%= f.label :subjects, "Subject(s): " %> <br>
    <%= f.collection_check_boxes :subject_ids, Subject.all, :id, :sub_name, class: 'checkbox' %>