app/views/books/show.html.erb

SELECT "subjects".* FROM "subjects" INNER JOIN "lesson_plans" ON "subjects"."id" = "lesson_plans"."subject_id" WHERE "lesson_plans"."book_id" = $1  [["book_id", 11]]
---
<p>Subject(s):
  <% @book.subjects.each do |subject| %>