app/controllers/books_controller.rb

    def create
      @book = Book.create(book_params)
---
INSERT INTO "books" ("title", "author", "publisher", "pages", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
      if @book.update(book_params)
---
UPDATE "books" SET "pages" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["pages", 325], ["updated_at", "2020-07-01 18:13:39.783531"], ["id", 5]]

    def set_book
      @book = Book.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]